html/about.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<meta name="description" content="agg_sig_me">
<link rel="stylesheet" href="css/tufte.css" type="text/css" />
</head>
<body>
<div id="body"><div id="container"><div id="navigation"><a href="index.html">Home</a> · <a href="about.html">About</a> · <a href="uses_this.html">Uses This</a></div><div id="content"><article><h1 class="title">About</h1>
<section><p>
I'm Geoff Walmlsey, a programmer on the team at <a href="https://chia.net">Chia Network</a>. I primarily work on Chialisp and writing wallet code.
</p>

<p>
My location changes fairly frequently:
</p>
<ul class="org-ul">
<li>New Zealand (home country)</li>
<li>United Kingdom</li>
<li>Netherlands</li>
<li>Greece</li>
</ul>

<p>
Here are some of my interests:
</p>
<ul class="org-ul">
<li>Emacs</li>
<li>Rust, Lisp, Mojo</li>
<li>Compiler Design</li>
<li>OSS</li>
</ul>
</section>

<section><h2>Contact Links</h2>
<ul class="org-ul">
<li>email: <a href="mailto:geoffwalmlsey@gmail.com">geoffwalmsley@gmail.com</a></li>
<li>keybase: <a href="https://keybase.io/geoff_w">geoff_w</a></li>
<li>github: <a href="https://github.com/geoffwalmsley">geoffwalmsley</a></li>
<li>twitter: <a href="https://twitter.com/geoffrey_io">geoffrey_io</a></li>
</ul>
</section>
